#print เพื่อ บอกข้อมูลก่อนกรอก
print("1. C เป็น F","2. F เป็น C","3. C เป็น K","4. K เป็น C",sep=",")
print("C คือ องศาเซลเซียส","F คือ องศาฟาเรนไฮต์","K คือ เคลวิน",sep=",")
print("อ่านตัวเลือกเพื่อนำไปเทียบอุณหภูมิของท่าน")
#input ใส่ข้อมูล
N = int(input("เลือกตัวเลือกของท่าน : "))
T = float(input("กรอกอุณภูมิของคุณ : "))
# คำสั่งเข้าสูตร
# องศาเซลเซียส เป็น องศาฟาเรนไฮต์
if N == 1:
    t = (T*1.8)+32
    print("อุณหภูมิ : % .2f"%t,"องศาฟาเรนไฮต์")
# องศาฟาเรนไฮต์ เป็น องศาเซลเซียส
if N == 2:
    t  = (T-32)/1.8
    print("อุณหภูมิ : % .2f"%t,"องศาเซลเซียส")
# องศาเซลเซียส เป็น เคลวิน
if N == 3:
    t = T+273.15
    print("อุณหภูมิ : % .2f"%t,"เคลวิน")
# เคลวิน เป็น องศาเซลเซียส
if N == 4:
    t = T-273.15
    print("อุณหภูมิ : % .2f"%t,"องศาเซลเซียส")


