#โค้ดคำนวณค่าไฟฟ้า
w = float(input("กรอกพลังงานไฟฟ้า (วัตต์) : ")) # w = wate
t = float(input("กรอกเวลาที่คุณใช้ไป (ชม.) : ")) # t = time
u = (w*t)/1000 #สูตรคำนวณค่าไฟ # u = unit
if u > 0 and u <= 15: #ถ้า u เป็น 0 - 15 หน่วย
        b = u * 2.3488 # u = baht นำมาเข้าสูตรนี้
elif u >= 16 and u <= 35: #ถ้า u เป็น 16 - 35 หน่วย
        b = u * 2.9882 #นำมาเข้าสูตรนี้
elif u >= 36 and u <= 100: #ถ้า u เป็น 36 - 100 หน่วย
        b = u * 3.2405 #นำมาเข้าสูตรนี้
elif u >= 101 and u <= 150: #ถ้า u เป็น 101 - 150 หน่วย
        b = u * 3.7171 #นำมาเข้าสูตรนี้
elif u >= 151 and u <= 400: #ถ้า u เป็น 151 - 400 หน่วย
        b = u * 4.2218 #นำมาเข้าสูตรนี้
elif u > 400: #ถ้า u เป็น มากกว่า 400 หน่วย
        b = u * 4.4217 #นำมาเข้าสูตรนี้
else: print("ไม่อยู่ในเงื่อนไข") #นอกเงื่อนไข
print("ค่ายูนิตของคุณคือ % .2f"%u,"หน่วย") #แสดงผล u
print("ค่าไฟฟ้าของคุณคือ % .2f"%b ,"บาท") #แสดงผล b
